GT2/RANS/KE_ShihQuadratic_lowRE/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    RASModel	    ShihQuadraticKE;		

//This seems to be a highRE implementation

/*
    Shih's quadratic algebraic Reynolds stress k-epsilon turbulence model for
    incompressible flows

    This turbulence model is described in:
        Shih, T. H., Zhu, J., & Lumley, J. L. (1993).
        A realizable Reynolds stress algebraic equation model.
        NASA technical memorandum 105993.
*/

    turbulence      on;

    printCoeffs     on;
}

// ************************************************************************* //
